Конфигурация отчетов/DataProcessors/ЗапланированыеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ЗапланированыеЗадачи</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаЗадач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/АтрибутыЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>АтрибутыЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:Type>cfg:CatalogRef.Объекты</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:EnumRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Атрибут</Name>
					<Type>
						<v8:Type>cfg:EnumRef.АтрибутыЗадачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/InformationRegisters/РодительЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>РодительЗадачи</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Родитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники_Отделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокЗадач</v8:Type>
						<v8:Type>cfg:TaskRef.Задачи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Конфигурация отчетов/Enums/АтрибутыЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>АтрибутыЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ответственный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инициатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтатусВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коментарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаСозданияЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СрокВыполнения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьМетку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьМетку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДобавитьОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьОборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Напоминание</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/Enums/СтатусВыполнения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусВыполнения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Создано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОжидании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаИсполнителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отложенно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Удалена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация отчетов/DataProcessors/ЗапланированыеЗадачи/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ЗаполнитьДеревоЗначений()
    // Создаем дерево значений
    ДеревоСЗадачами = Новый ДеревоЗначений;
    ДеревоСЗадачами.Колонки.Добавить("Задача");
    ДеревоСЗадачами.Колонки.Добавить("Статус");
    
    // Запрос для получения задач и их статусов
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	АтрибутыЗадачиСрезПоследних.Задача КАК Задача,
    |	АтрибутыЗадачиСрезПоследних.Значение КАК Статус,
    |	АтрибутыЗадачиСрезПоследних1.Период КАК Период,
    |	АтрибутыЗадачиСрезПоследних1.Задача КАК Задача1,
    |	АтрибутыЗадачиСрезПоследних1.Атрибут КАК Атрибут,
    |	АтрибутыЗадачиСрезПоследних1.Значение КАК Значение,
    |	АтрибутыЗадачиСрезПоследних1.Автор КАК Автор
    |ИЗ
    |	РегистрСведений.АтрибутыЗадачи.СрезПоследних(, Атрибут = &Запланировано) КАК АтрибутыЗадачиСрезПоследних1
    |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АтрибутыЗадачи.СрезПоследних(, Атрибут = &Атрибут) КАК АтрибутыЗадачиСрезПоследних
    |		ПО (АтрибутыЗадачиСрезПоследних.Задача = АтрибутыЗадачиСрезПоследних1.Задача)
    |ГДЕ
    |	НЕ АтрибутыЗадачиСрезПоследних.Задача В
    |				(ВЫБРАТЬ
    |					РодительЗадачи.Задача
    |				ИЗ
    |					РегистрСведений.РодительЗадачи КАК РодительЗадачи)
    |ИТОГИ ПО
    |	Задача";
    
    Запрос.УстановитьПараметр("Атрибут", Перечисления.АтрибутыЗадачи.СтатусВыполнения);
    Запрос.УстановитьПараметр("Атрибут", Перечисления.АтрибутыЗадачи.Запланировано);
	Запрос.УстановитьПараметр("Запланировано", ТекущаяДата());

    РезультатЗапроса = Запрос.Выполнить();
    
    // Обходим результат запроса
    Выборка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
    Пока Выборка.Следующий() Цикл
        // Добавляем задачу первого уровня
        ЗадачаПервогоУровня = ДеревоСЗадачами.Строки.Добавить();
        ЗадачаПервогоУровня.Задача = Выборка.Задача;
        ЗадачаПервогоУровня.Статус = Выборка.Статус;
        
        // Рекурсивно добавляем подчиненные задачи
        ДобавитьПодчиненныеЗадачи(ЗадачаПервогоУровня, Выборка.Задача, ДеревоСЗадачами);
    КонецЦикла;
    
    // Помещаем дерево в реквизит формы
    ЗначениеВРеквизитФормы(ДеревоСЗадачами, "ДеревоЗадач");
КонецПроцедуры

&НаСервере
Процедура НастроитьУсловноеОформление()
    // Очищаем существующее оформление (опционально)
    Элементы.ДеревоЗадач.УсловноеОформление.Элементы.Очистить();
    
    // Создаем элемент условного оформления
    ЭлементОформления = Элементы.ДеревоЗадач.УсловноеОформление.Элементы.Добавить();
    
    // Условие: Статус = "Выполнено"
    ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЗадач.Статус");
    ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементУсловия.ПравоеЗначение = "Выполнено"; // Замените на ваше значение статуса
    
    // Оформление: зеленый цвет текста
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.Зеленый);
    
    // Поля, к которым применяется оформление
    ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЗадачЗадача");
    ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЗадачСтатус");
    
    // Пример для другого статуса, например, "В работе"
    ЭлементОформления = Элементы.ДеревоЗадач.УсловноеОформление.Элементы.Добавить();
    ЭлементУсловия = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
    ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ДеревоЗадач.Статус");
    ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
    ЭлементУсловия.ПравоеЗначение = Перечисления.СтатусВыполнения.Завершено;
    ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", WebЦвета.ЗеленаяЛужайка);
    
    ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЗадачЗадача");
    ОформляемоеПоле = ЭлементОформления.Поля.Элементы.Добавить();
    ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ДеревоЗадачСтатус");
КонецПроцедуры

// Рекурсивная процедура для добавления подчиненных задач
&НаСервере
Процедура ДобавитьПодчиненныеЗадачи(СтрокаДерева, РодительскаяЗадача, ДеревоСЗадачами)
    // Запрос для получения подчиненных задач
    Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |    РодительЗадачи.Задача КАК Задача,
    |    АтрибутыЗадачиСрезПоследних.Значение КАК Статус
    |ИЗ
    |    РегистрСведений.РодительЗадачи КАК РодительЗадачи
    |        ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АтрибутыЗадачи.СрезПоследних(, Атрибут = &Атрибут) КАК АтрибутыЗадачиСрезПоследних
    |        ПО РодительЗадачи.Задача = АтрибутыЗадачиСрезПоследних.Задача
    |ГДЕ
    |    РодительЗадачи.Родитель = &Родитель";
    
    Запрос.УстановитьПараметр("Родитель", РодительскаяЗадача);
    Запрос.УстановитьПараметр("Атрибут", Перечисления.АтрибутыЗадачи.СтатусВыполнения);
    
    РезультатЗапроса = Запрос.Выполнить();
    Выборка = РезультатЗапроса.Выбрать();
    
    // Обходим подчиненные задачи
    Пока Выборка.Следующий() Цикл
        // Добавляем подчиненную задачу
        ПодчиненнаяЗадача = СтрокаДерева.Строки.Добавить();
        ПодчиненнаяЗадача.Задача = Выборка.Задача;
        ПодчиненнаяЗадача.Статус = Выборка.Статус;
        
        // Рекурсивно добавляем вложенные задачи
        ДобавитьПодчиненныеЗадачи(ПодчиненнаяЗадача, Выборка.Задача, ДеревоСЗадачами);
    КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ДатаЗадачПриИзменении(Элемент)
	ЗаполнитьДеревоЗначений();
КонецПроцедуры
